# SchedulableField Operators

---
The SchedulableField type exposes the following members.
| Name| Description
---|---|---
| Equality(SchedulableField, SchedulableField)| Determines whether two SchedulableField are the same.
| Inequality(SchedulableField, SchedulableField)| Determines whether two SchedulableField are different.
Top
#### Reference
SchedulableField Class
Autodesk.Revit.DB Namespace